src/Catalogs/ГрафикиРаботыСотрудников/ГрафикиРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиРаботыСотрудников</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоГрафика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДней</name>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ГрафикиРаботыПредприятия/ГрафикиРаботыПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботыПредприятия</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ГрафикиРаботыСотрудников/Forms/ФормаЭлемента/Module.bsl
// Форма элемента справочника "ГрафикиРаботыСотрудников".
// Позволяет заполнять табличную часть "СписокДней" двумя способами:
//   1 – по будням (пн–пт) на заданный период,
//   2 – циклический график (чередование рабочих/выходных блоков заданной длины).
// Также позволяет выгрузить заполненный график в регистр сведений
// "ГрафикиРаботыПредприятия" (через вызов серверного метода ЗаполнитьГрафики).

#Область ОбработчикиСобытийФормы

// При открытии формы инициализируем значения по умолчанию (начало/конец текущего года,
// способ заполнения = 1 (по будням), начало графика = 1 (рабочий день)),
// если они не были заданы. Затем настраиваем видимость.
&НаКлиенте
Процедура ПриОткрытии(Отказ)   
    Если Объект.НачалоПериода = '00010101' И Объект.КонецПериода = '00010101' Тогда
        Объект.НачалоПериода = НачалоГода(ТекущаяДата());
        Объект.КонецПериода  = КонецГода(ТекущаяДата());
    КонецЕсли;
    Если Объект.СпособЗаполнения = 0 Тогда
        Объект.СпособЗаполнения = 1;
    КонецЕсли;
    Если Объект.НачалоГрафика = 0 Тогда
        Объект.НачалоГрафика = 1; 
    КонецЕсли;
    УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
    ПроверкаКорректностьПериода();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
    ПроверкаКорректностьПериода();
КонецПроцедуры

// При изменении способа заполнения обновляем видимость дополнительных реквизитов.
&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)
    УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Команда "ЗагрузитьВГрафикПредприятия" (кнопка на форме).
// Предварительно проверяет, есть ли данные в табличной части, и вызывает серверную загрузку.
&НаКлиенте
Процедура ЗагрузитьВГрафикПредприятия(Команда)
    Если Объект.СписокДней.Количество() > 0 Тогда
        ЗагрузитьВГрафикПредприятияНаСервере();
    Иначе
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "График работы не содержит данных, сначала заполните график работы!";
        Сообщение.Сообщить();
    КонецЕсли; 
КонецПроцедуры

// Команда "ЗаполнитьГрафик" – очищает текущую табличную часть и перезаполняет её
// выбранным способом (1 – по будням, 2 – циклический).
&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
    Объект.СписокДней.Очистить();
    
    Если Объект.СпособЗаполнения = 1 Тогда
        ЗаполнитьПоБудням();
    ИначеЕсли Объект.СпособЗаполнения = 2 Тогда
        ЗаполнитьЦиклическийГрафик();
    КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выгружает данные из табличной части текущего элемента справочника
// и загружает их в регистр сведений "ГрафикиРаботыПредприятия".
&НаСервере  
Процедура ЗагрузитьВГрафикПредприятияНаСервере()
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    ГрафикиРаботыСотрудниковСписокДней.День КАК День,
    |    ГрафикиРаботыСотрудниковСписокДней.КоличествоЧасов КАК КоличествоЧасов,
    |    ГрафикиРаботыСотрудниковСписокДней.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.ГрафикиРаботыСотрудников.СписокДней КАК ГрафикиРаботыСотрудниковСписокДней
    |ГДЕ
    |    ГрафикиРаботыСотрудниковСписокДней.Ссылка = &Ссылка
    |    И ГрафикиРаботыСотрудниковСписокДней.КоличествоЧасов > 0";
    
    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
    ДанныеГрафика = Запрос.Выполнить().Выгрузить();
    
    РегистрыСведений.ГрафикиРаботыПредприятия.ЗаполнитьГрафики(ДанныеГрафика);
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = СтрШаблон("График работы %1 успешно загружен.", Объект.Наименование);
    Сообщение.Сообщить(); 
КонецПроцедуры

// Заполнение табличной части рабочими днями (пн–пт) в заданном периоде.
&НаКлиенте
Процедура ЗаполнитьПоБудням()
    СуткиВСекундах = 86400;
    ТекущийДень = Объект.НачалоПериода;
    
    Пока ТекущийДень <= Объект.КонецПериода Цикл
        НоваяСтрока = Объект.СписокДней.Добавить();
        НоваяСтрока.День = ТекущийДень;
        
        // В 1С ДеньНедели(…) возвращает 1–7 (1 – понедельник, 7 – воскресенье).
        // Значение < 6 охватывает понедельник–пятницу.
        ЭтоРабочийДень = (ДеньНедели(ТекущийДень) < 6);
        
        Если ЭтоРабочийДень Тогда
            НоваяСтрока.КоличествоЧасов = Объект.КоличествоЧасов;
        КонецЕсли;
        
        ТекущийДень = ТекущийДень + СуткиВСекундах;
    КонецЦикла;   
КонецПроцедуры

// Заполнение табличной части по циклическому графику.
&НаКлиенте
Процедура ЗаполнитьЦиклическийГрафик()
    СуткиВСекундах = 86400;
    ТекущийДень = Объект.НачалоПериода;
    
    Если Объект.НачалоГрафика = 1 Тогда
        ЭтоРабочийДень = Истина;
    Иначе
        ЭтоРабочийДень = Ложь;
    КонецЕсли;
    
    Счетчик = 0;
    
    Пока ТекущийДень <= Объект.КонецПериода Цикл
        НоваяСтрока = Объект.СписокДней.Добавить();
        НоваяСтрока.День = ТекущийДень;
        
        Если ЭтоРабочийДень Тогда
            НоваяСтрока.КоличествоЧасов = Объект.КоличествоЧасов;
        КонецЕсли;
        
        Счетчик = Счетчик + 1;
        ТекущийДень = ТекущийДень + СуткиВСекундах;
        
        // Переключение состояния через каждые "ШагДней".
        Если Счетчик % Объект.ШагДней = 0 Тогда 
            ЭтоРабочийДень = Не ЭтоРабочийДень;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

// Проверка корректности периода: начало не должно быть позже окончания.
// Вызывается при изменении дат начала и конца периода.
&НаКлиенте
Процедура ПроверкаКорректностьПериода()
    Если ЗначениеЗаполнено(Объект.КонецПериода) И Объект.НачалоПериода > Объект.КонецПериода Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Начало периода не может быть больше окончания!";
        Сообщение.Сообщить();
    КонецЕсли;
КонецПроцедуры 

// Управляет видимостью элементов "ШагДней" и "НачалоГрафика" – они показываются
// только для циклического способа заполнения (СпособЗаполнения = 2).
&НаКлиенте
Процедура УправлениеВидимостью()
    ЭтоЦикличныйГрафик = Объект.СпособЗаполнения = 2;
    Элементы.ШагДней.Видимость = ЭтоЦикличныйГрафик;
    Элементы.НачалоГрафика.Видимость = ЭтоЦикличныйГрафик;
КонецПроцедуры

#КонецОбласти
